import React from 'react';

import { Card, CardContent, Typography } from '@mui/material';

export const AboutPage: React.FC = () => {
  return (
    <Card sx={{ padding: 2 }} elevation={2}>
      <CardContent>
        <Typography variant="h5" gutterBottom>
          Про Нашу Платформу
        </Typography>
        <Typography variant="h6" component="h3" gutterBottom>
          Місія
        </Typography>
        <Typography paragraph>
          Наша місія полягає в тому, щоб зробити мистецтво доступним і
          забезпечити зручну, безпечну платформу для купівлі та продажу
          арт-об'єктів з усього світу. Ми прагнемо вирішити проблеми, які
          існують на сучасних аукціонних майданчиках, такі як прозорість
          транзакцій і автентичність творів.
        </Typography>
        <Typography variant="h6" component="h3" gutterBottom>
          Візія
        </Typography>
        <Typography paragraph>
          Стати провідною платформою для аукціонів мистецтва, відомою своєю
          надійністю, інноваційністю та здатністю задовольняти потреби
          художників та колекціонерів на міжнародному рівні.
        </Typography>
        <Typography variant="h6" component="h3" gutterBottom>
          Як Це Працює
        </Typography>
        <Typography paragraph>
          Наш аукціонний процес простий і прозорий:
          <ol>
            <li>
              Реєстрація: Створіть акаунт за лічені хвилини, використовуючи свою
              електронну пошту чи соціальні мережі.
            </li>
            <li>
              Вибір лоту: Перегляньте різноманіття лотів в нашому каталозі або
              використовуйте фільтри для специфічних запитів.
            </li>
            <li>
              Ставки: Зробіть ставку на лот, який вам сподобався. Система
              автоматично повідомляє вас, якщо хтось перевищить вашу ставку.
            </li>
            <li>
              Виграш: Якщо ваша ставка залишається найвищою до закінчення
              аукціону, ви виграєте лот.
            </li>
            <li>
              Оплата і доставка: На пряму контактуйте з продавцем та
              організовуйте оплату та доставку згідно домовленостей або
              попередньо описаних правил в лоті.
            </li>
          </ol>
        </Typography>
        <Typography variant="h6" component="h3" gutterBottom>
          Інновації
        </Typography>
        <Typography paragraph>
          Ми інтегруємо передові технології для забезпечення безпеки, зручності
          користування, та автентичності кожної угоди. Наша платформа
          використовує надійні архітектурні рішення для гарантування
          стабільності системи.
        </Typography>
        <Typography variant="h6" component="h3" gutterBottom>
          Як Ми Відрізняємося
        </Typography>
        <Typography paragraph>
          Від інших онлайн-аукціонів ми відрізняємося фокусом на арт-сегменті,
          налаштованими на специфіку цієї галузі сервісами і високим ступенем
          інтеграції з соціальними мережами для спрощення процесів реєстрації та
          входу.
        </Typography>
      </CardContent>
    </Card>
  );
};
